results/run-stages.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: stages.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 001/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 001/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 002/100 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 002/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   8% ] 002/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 002/100 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 002/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [  12% ] 002/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 003/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 003/100 VUs, 8 complete and 0 interrupted iterations
default   [  15% ] 003/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [  17% ] 003/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 003/100 VUs, 11 complete and 0 interrupted iterations
default   [  18% ] 003/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 004/100 VUs, 14 complete and 0 interrupted iterations
default   [  20% ] 004/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [  22% ] 004/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 004/100 VUs, 18 complete and 0 interrupted iterations
default   [  23% ] 004/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 004/100 VUs, 22 complete and 0 interrupted iterations
default   [  25% ] 004/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 006/100 VUs, 24 complete and 0 interrupted iterations
default   [  27% ] 006/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 008/100 VUs, 27 complete and 0 interrupted iterations
default   [  28% ] 008/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 009/100 VUs, 32 complete and 0 interrupted iterations
default   [  30% ] 009/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 011/100 VUs, 37 complete and 0 interrupted iterations
default   [  32% ] 011/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 013/100 VUs, 43 complete and 0 interrupted iterations
default   [  33% ] 013/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 014/100 VUs, 51 complete and 0 interrupted iterations
default   [  35% ] 014/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 016/100 VUs, 61 complete and 0 interrupted iterations
default   [  37% ] 016/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 018/100 VUs, 71 complete and 0 interrupted iterations
default   [  38% ] 018/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 019/100 VUs, 82 complete and 0 interrupted iterations
default   [  40% ] 019/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 021/100 VUs, 96 complete and 0 interrupted iterations
default   [  42% ] 021/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 023/100 VUs, 109 complete and 0 interrupted iterations
default   [  43% ] 023/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 024/100 VUs, 126 complete and 0 interrupted iterations
default   [  45% ] 024/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 026/100 VUs, 139 complete and 0 interrupted iterations
default   [  47% ] 026/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 028/100 VUs, 158 complete and 0 interrupted iterations
default   [  48% ] 028/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 029/100 VUs, 176 complete and 0 interrupted iterations
default   [  50% ] 029/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 034/100 VUs, 195 complete and 0 interrupted iterations
default   [  52% ] 034/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 039/100 VUs, 212 complete and 0 interrupted iterations
default   [  53% ] 039/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 043/100 VUs, 238 complete and 0 interrupted iterations
default   [  55% ] 043/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 048/100 VUs, 261 complete and 0 interrupted iterations
default   [  57% ] 048/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 053/100 VUs, 290 complete and 0 interrupted iterations
default   [  58% ] 053/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 057/100 VUs, 327 complete and 0 interrupted iterations
default   [  60% ] 057/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 062/100 VUs, 365 complete and 0 interrupted iterations
default   [  62% ] 062/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 067/100 VUs, 396 complete and 0 interrupted iterations
default   [  63% ] 067/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 071/100 VUs, 450 complete and 0 interrupted iterations
default   [  65% ] 071/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 076/100 VUs, 490 complete and 0 interrupted iterations
default   [  67% ] 076/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 081/100 VUs, 532 complete and 0 interrupted iterations
default   [  68% ] 081/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 085/100 VUs, 595 complete and 0 interrupted iterations
default   [  70% ] 085/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 090/100 VUs, 656 complete and 0 interrupted iterations
default   [  72% ] 090/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 095/100 VUs, 714 complete and 0 interrupted iterations
default   [  73% ] 095/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 099/100 VUs, 773 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 099/100 VUs, 854 complete and 0 interrupted iterations
default   [  77% ] 099/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 094/100 VUs, 914 complete and 0 interrupted iterations
default   [  78% ] 094/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 087/100 VUs, 966 complete and 0 interrupted iterations
default   [  80% ] 087/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 078/100 VUs, 1045 complete and 0 interrupted iterations
default   [  82% ] 078/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 072/100 VUs, 1095 complete and 0 interrupted iterations
default   [  83% ] 072/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 065/100 VUs, 1145 complete and 0 interrupted iterations
default   [  85% ] 065/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 059/100 VUs, 1195 complete and 0 interrupted iterations
default   [  87% ] 059/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 052/100 VUs, 1239 complete and 0 interrupted iterations
default   [  88% ] 052/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 045/100 VUs, 1275 complete and 0 interrupted iterations
default   [  90% ] 045/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 040/100 VUs, 1302 complete and 0 interrupted iterations
default   [  92% ] 040/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 028/100 VUs, 1342 complete and 0 interrupted iterations
default   [  93% ] 028/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 025/100 VUs, 1358 complete and 0 interrupted iterations
default   [  95% ] 025/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 022/100 VUs, 1372 complete and 0 interrupted iterations
default   [  97% ] 022/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 013/100 VUs, 1392 complete and 0 interrupted iterations
default   [  98% ] 013/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 004/100 VUs, 1403 complete and 0 interrupted iterations
default   [ 100% ] 004/100 VUs  1m00.0s/1m00.0s

running (1m01.0s), 001/100 VUs, 1406 complete and 0 interrupted iterations
default ↓ [ 100% ] 004/100 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<406.08' p(95)=335.16ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1407    22.966116/s
    checks_succeeded...: 100.00% 1407 out of 1407
    checks_failed......: 0.00%   0 out of 1407

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=212.67ms min=55.96ms med=205.34ms max=1.17s p(90)=313.77ms p(95)=335.16ms
      { expected_response:true }...: avg=212.67ms min=55.96ms med=205.34ms max=1.17s p(90)=313.77ms p(95)=335.16ms
    http_req_failed................: 0.00%  0 out of 2814
    http_reqs......................: 2814   45.932232/s

    EXECUTION
    iteration_duration.............: avg=1.48s    min=1.28s   med=1.42s    max=2.85s p(90)=1.53s    p(95)=2.25s   
    iterations.....................: 1407   22.966116/s
    vus............................: 1      min=1         max=99 
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 6.1 MB 99 kB/s
    data_sent......................: 475 kB 7.7 kB/s



running (1m01.3s), 000/100 VUs, 1407 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m0s